---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FabricFailures.CoverOffsetTooLongTemp
source: html/40539c5e-1007-1551-e7f1-233012154c38.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FabricFailures.CoverOffsetTooLongTemp Property

Cover offset is greater than host thickness - support for transient Single Fabric Sheet in editor.

## Syntax (C#)
```csharp
public static FailureDefinitionId CoverOffsetTooLongTemp { get; }
```